# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Working with JSON files

Import the pandas library

In [2]:
# Your import here:

import pandas as pd

####  After importing pandas, let's find a dataset. In this lesson we will be working with a NASA dataset.

Run the code in the cell below to load the dataset containing information about asteroids that have landed on earth. This piece of code helps us open the URL for the dataset and deocde the data using UTF-8.

In [3]:
# Run this code

from urllib.request import urlopen
import json

response = urlopen("https://data.nasa.gov/resource/y77d-th95.json")
json_data = response.read().decode('utf-8', 'replace')
#print(json_data)

In the next cell, load the data in `json_data` and load it into a pandas dataframe. Name the dataframe `nasa`.

In [4]:
# Your code here:
nasa = pd.read_json(json_data)
print(nasa)

          name     id nametype               recclass      mass  fall  \
0       Aachen      1    Valid                     L5      21.0  Fell
1       Aarhus      2    Valid                     H6     720.0  Fell
2         Abee      6    Valid                    EH4  107000.0  Fell
3     Acapulco     10    Valid            Acapulcoite    1914.0  Fell
4      Achiras    370    Valid                     L6     780.0  Fell
..         ...    ...      ...                    ...       ...   ...
995   Tirupati  24009    Valid                     H6     230.0  Fell
996    Tissint  54823    Valid  Martian (shergottite)    7000.0  Fell
997      Tjabe  24011    Valid                     H6   20000.0  Fell
998   Tjerebon  24012    Valid                     L5   16500.0  Fell
999  Tomakovka  24019    Valid                    LL6     600.0  Fell

                        year    reclat    reclong  \
0    1880-01-01T00:00:00.000  50.77500    6.08333
1    1951-01-01T00:00:00.000  56.18333   10.23333
2    1952-01-01T00:00:00.000  54.21667 -113.00000
3    1976-01-01T00:00:00.000  16.88333  -99.90000
4    1902-01-01T00:00:00.000 -33.16667  -64.95000
..                       ...       ...        ...
995  1934-01-01T00:00:00.000  13.63333   79.41667
996  2011-01-01T00:00:00.000  29.48195   -7.61123
997  1869-01-01T00:00:00.000  -7.08333  111.53333
998  1922-01-01T00:00:00.000  -6.66667  106.58333
999  1905-01-01T00:00:00.000  47.85000   34.76667

                                           geolocation  \
0    {'type': 'Point', 'coordinates': [6.08333, 50....
1    {'type': 'Point', 'coordinates': [10.23333, 56...
2    {'type': 'Point', 'coordinates': [-113, 54.216...
3    {'type': 'Point', 'coordinates': [-99.9, 16.88...
4    {'type': 'Point', 'coordinates': [-64.95, -33....
..                                                 ...
995  {'type': 'Point', 'coordinates': [79.41667, 13...
996  {'type': 'Point', 'coordinates': [-7.61123, 29...
997  {'type': 'Point', 'coordinates': [111.53333, -...
998  {'type': 'Point', 'coordinates': [106.58333, -...
999  {'type': 'Point', 'coordinates': [34.76667, 47...

     :@computed_region_cbhk_fwbd  :@computed_region_nnqa_25f4
0                            NaN                          NaN
1                            NaN                          NaN
2                            NaN                          NaN
3                            NaN                          NaN
4                            NaN                          NaN
..                           ...                          ...
995                          NaN                          NaN
996                          NaN                          NaN
997                          NaN                          NaN
998                          NaN                          NaN
999                          NaN                          NaN

[1000 rows x 12 columns]

Now that we have loaded the data, let's examine it using the `head()` function.

In [5]:
# Your code here:
print(nasa.head())

       name   id nametype     recclass      mass  fall  \
0    Aachen    1    Valid           L5      21.0  Fell
1    Aarhus    2    Valid           H6     720.0  Fell
2      Abee    6    Valid          EH4  107000.0  Fell
3  Acapulco   10    Valid  Acapulcoite    1914.0  Fell
4   Achiras  370    Valid           L6     780.0  Fell

                      year    reclat    reclong  \
0  1880-01-01T00:00:00.000  50.77500    6.08333
1  1951-01-01T00:00:00.000  56.18333   10.23333
2  1952-01-01T00:00:00.000  54.21667 -113.00000
3  1976-01-01T00:00:00.000  16.88333  -99.90000
4  1902-01-01T00:00:00.000 -33.16667  -64.95000

                                         geolocation  \
0  {'type': 'Point', 'coordinates': [6.08333, 50....
1  {'type': 'Point', 'coordinates': [10.23333, 56...
2  {'type': 'Point', 'coordinates': [-113, 54.216...
3  {'type': 'Point', 'coordinates': [-99.9, 16.88...
4  {'type': 'Point', 'coordinates': [-64.95, -33....

   :@computed_region_cbhk_fwbd  :@computed_region_nnqa_25f4
0                          NaN                          NaN
1                          NaN                          NaN
2                          NaN                          NaN
3                          NaN                          NaN
4                          NaN                          NaN

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [6]:
# Your code here:
fall_value = nasa['fall'].value_counts()
print(fall_value)

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Since we downloaded the file from an online source, the goal of saving the dataframe is to have a local copy. Save the dataframe using the `orient=records` argument and name the file `nasa.json`.

In [7]:
import pandas as pd
# Your code here:
#nasa.to_jason('file1.json', orient='records', compression = 'infer')
nasa.to_json('file.json', orient = 'split', compression = 'infer', index = 'true') 
#Para abrir el archivo
#df = pd.read_json('file1.json', orient='split', compression = 'infer')
df = pd.read_json('file.json', orient ='split', compression = 'infer') 

print(df)

          name     id nametype               recclass      mass  fall  \
0       Aachen      1    Valid                     L5      21.0  Fell
1       Aarhus      2    Valid                     H6     720.0  Fell
2         Abee      6    Valid                    EH4  107000.0  Fell
3     Acapulco     10    Valid            Acapulcoite    1914.0  Fell
4      Achiras    370    Valid                     L6     780.0  Fell
..         ...    ...      ...                    ...       ...   ...
995   Tirupati  24009    Valid                     H6     230.0  Fell
996    Tissint  54823    Valid  Martian (shergottite)    7000.0  Fell
997      Tjabe  24011    Valid                     H6   20000.0  Fell
998   Tjerebon  24012    Valid                     L5   16500.0  Fell
999  Tomakovka  24019    Valid                    LL6     600.0  Fell

                        year    reclat    reclong  \
0    1880-01-01T00:00:00.000  50.77500    6.08333
1    1951-01-01T00:00:00.000  56.18333   10.23333
2    1952-01-01T00:00:00.000  54.21667 -113.00000
3    1976-01-01T00:00:00.000  16.88333  -99.90000
4    1902-01-01T00:00:00.000 -33.16667  -64.95000
..                       ...       ...        ...
995  1934-01-01T00:00:00.000  13.63333   79.41667
996  2011-01-01T00:00:00.000  29.48195   -7.61123
997  1869-01-01T00:00:00.000  -7.08333  111.53333
998  1922-01-01T00:00:00.000  -6.66667  106.58333
999  1905-01-01T00:00:00.000  47.85000   34.76667

                                           geolocation  \
0    {'type': 'Point', 'coordinates': [6.08333, 50....
1    {'type': 'Point', 'coordinates': [10.23333, 56...
2    {'type': 'Point', 'coordinates': [-113, 54.216...
3    {'type': 'Point', 'coordinates': [-99.9, 16.88...
4    {'type': 'Point', 'coordinates': [-64.95, -33....
..                                                 ...
995  {'type': 'Point', 'coordinates': [79.41667, 13...
996  {'type': 'Point', 'coordinates': [-7.61123, 29...
997  {'type': 'Point', 'coordinates': [111.53333, -...
998  {'type': 'Point', 'coordinates': [106.58333, -...
999  {'type': 'Point', 'coordinates': [34.76667, 47...

     :@computed_region_cbhk_fwbd  :@computed_region_nnqa_25f4
0                            NaN                          NaN
1                            NaN                          NaN
2                            NaN                          NaN
3                            NaN                          NaN
4                            NaN                          NaN
..                           ...                          ...
995                          NaN                          NaN
996                          NaN                          NaN
997                          NaN                          NaN
998                          NaN                          NaN
999                          NaN                          NaN

[1000 rows x 12 columns]

# Challenge 2 - Working with CSV and Other Separated Files

csv files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a csv file into a dataframe directly from a URL without having to load the file first like we did with the JSON URL. The dataset we will be using contains informtaions about NASA shuttles. 

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [8]:
# Run this code:

cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [9]:
# Your code here:
#shuttle = pd.read_csv(tst_url, sep=' ')
#df = pd.DataFrame(shuttle)
#shuttle(columns = cols)
shuttle = pd.DataFrame(pd.read_csv(tst_url, sep=' '), columns = cols)
print(shuttle)

       time  rad_flow  fpv_close  fpv_open  high  bypass  bpv_close  bpv_open  \
0       NaN       NaN        NaN       NaN   NaN     NaN        NaN       NaN
1       NaN       NaN        NaN       NaN   NaN     NaN        NaN       NaN
2       NaN       NaN        NaN       NaN   NaN     NaN        NaN       NaN
3       NaN       NaN        NaN       NaN   NaN     NaN        NaN       NaN
4       NaN       NaN        NaN       NaN   NaN     NaN        NaN       NaN
...     ...       ...        ...       ...   ...     ...        ...       ...
14494   NaN       NaN        NaN       NaN   NaN     NaN        NaN       NaN
14495   NaN       NaN        NaN       NaN   NaN     NaN        NaN       NaN
14496   NaN       NaN        NaN       NaN   NaN     NaN        NaN       NaN
14497   NaN       NaN        NaN       NaN   NaN     NaN        NaN       NaN
14498   NaN       NaN        NaN       NaN   NaN     NaN        NaN       NaN

       class
0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
...      ...
14494    NaN
14495    NaN
14496    NaN
14497    NaN
14498    NaN

[14499 rows x 9 columns]

Let's verify that this worked by looking at the `head()` function.

In [10]:
# Your code here:
print(shuttle.head())

   time  rad_flow  fpv_close  fpv_open  high  bypass  bpv_close  bpv_open  \
0   NaN       NaN        NaN       NaN   NaN     NaN        NaN       NaN
1   NaN       NaN        NaN       NaN   NaN     NaN        NaN       NaN
2   NaN       NaN        NaN       NaN   NaN     NaN        NaN       NaN
3   NaN       NaN        NaN       NaN   NaN     NaN        NaN       NaN
4   NaN       NaN        NaN       NaN   NaN     NaN        NaN       NaN

   class
0    NaN
1    NaN
2    NaN
3    NaN
4    NaN

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated and that we are not saving the index column.

In [11]:
# Your code here:
shuttle.to_csv('shuttle.csv', index=False, sep=',')
pd.read_csv('shuttle.csv')

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
14494,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14495,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14496,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14497,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14498,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the same folder that contains this notebook. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [12]:
# Your code here:
astronaut = pd.read_excel("astronauts.xls")
print(astronaut)

                      Name    Year  Group   Status Birth Date  \
0          Joseph M. Acaba  2004.0   19.0   Active 1967-05-17
1           Loren W. Acton     NaN    NaN  Retired 1936-03-07
2         James C. Adamson  1984.0   10.0  Retired 1946-03-03
3          Thomas D. Akers  1987.0   12.0  Retired 1951-05-20
4              Buzz Aldrin  1963.0    3.0  Retired 1930-01-20
..                     ...     ...    ...      ...        ...
352          David A. Wolf  1990.0   13.0  Retired 1956-08-23
353  Neil W. Woodward III   1998.0   17.0  Retired 1962-07-26
354       Alfred M. Worden  1966.0    5.0  Retired 1932-02-07
355          John W. Young  1962.0    2.0  Retired 1930-09-24
356        George D. Zamka  1998.0   17.0  Retired 1962-06-29

           Birth Place Gender  \
0        Inglewood, CA   Male
1         Lewiston, MT   Male
2           Warsaw, NY   Male
3        St. Louis, MO   Male
4        Montclair, NJ   Male
..                 ...    ...
352   Indianapolis, IN   Male
353        Chicago, IL   Male
354        Jackson, MI   Male
355  San Francisco, CA   Male
356    Jersey City, NJ   Male

                                            Alma Mater  \
0    University of California-Santa Barbara; Univer...
1     Montana State University; University of Colorado
2            US Military Academy; Princeton University
3                         University of Missouri-Rolla
4                             US Military Academy; MIT
..                                                 ...
352              Purdue University; Indiana University
353  MIT; University of Texas-Austin; George Washin...
354        US Military Academy; University of Michigan
355                    Georgia Institute of Technology
356  US Naval Academy; Florida Institute of Technology

          Undergraduate Major                            Graduate Major  \
0                     Geology                                   Geology
1         Engineering Physics                             Solar Physics
2                 Engineering                     Aerospace Engineering
3         Applied Mathematics                       Applied Mathematics
4      Mechanical Engineering                              Astronautics
..                        ...                                       ...
352    Electrical Engineering                                  Medicine
353                   Physics              Physics; Business Management
354          Military Science  Aeronautical & Astronautical Engineering
355  Aeronautical Engineering                                       NaN
356               Mathematics                    Engineering Management

    Military Rank            Military Branch  Space Flights  \
0             NaN                        NaN              2
1             NaN                        NaN              1
2         Colonel          US Army (Retired)              2
3         Colonel     US Air Force (Retired)              4
4         Colonel     US Air Force (Retired)              2
..            ...                        ...            ...
352           NaN                        NaN              3
353     Commander                    US Navy              0
354       Colonel     US Air Force (Retired)              1
355       Captain          US Navy (Retired)              6
356       Colonel  US Marine Corps (Retired)              2

     Space Flight (hr)  Space Walks  Space Walks (hr)  \
0                 3307            2              13.0
1                  190            0               0.0
2                  334            0               0.0
3                  814            4              29.0
4                  289            2               8.0
..                 ...          ...               ...
352               4044            7              41.0
353                  0            0               0.0
354                295            1               0.5
355                835            3              20.0
356                692            0               0.0

                                              Missions Death Date  \
0               STS-119 (Discovery), ISS-31/32 (Soyuz)        NaT
1                                STS 51-F (Challenger)        NaT
2                 STS-28 (Columbia), STS-43 (Atlantis)        NaT
3    STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...        NaT
4                                 Gemini 12, Apollo 11        NaT
..                                                 ...        ...
352  STS-58 (Columbia). STS-86/89 (Atlantis/Endeavo...        NaT
353                                                NaN        NaT
354                                          Apollo 15        NaT
355  Gemini 3, Gemini 10, Apollo 10, Apollo 16, STS...        NaT
356            STS-120 (Discovery), STS-130 (Endeavor)        NaT

    Death Mission
0             NaN
1             NaN
2             NaN
3             NaN
4             NaN
..            ...
352           NaN
353           NaN
354           NaN
355           NaN
356           NaN

[357 rows x 19 columns]

Use the `head()` function to inspect the dataframe.

In [13]:
# Your code here:
print(astronaut.head())

               Name    Year  Group   Status Birth Date    Birth Place Gender  \
0   Joseph M. Acaba  2004.0   19.0   Active 1967-05-17  Inglewood, CA   Male
1    Loren W. Acton     NaN    NaN  Retired 1936-03-07   Lewiston, MT   Male
2  James C. Adamson  1984.0   10.0  Retired 1946-03-03     Warsaw, NY   Male
3   Thomas D. Akers  1987.0   12.0  Retired 1951-05-20  St. Louis, MO   Male
4       Buzz Aldrin  1963.0    3.0  Retired 1930-01-20  Montclair, NJ   Male

                                          Alma Mater     Undergraduate Major  \
0  University of California-Santa Barbara; Univer...                 Geology
1   Montana State University; University of Colorado     Engineering Physics
2          US Military Academy; Princeton University             Engineering
3                       University of Missouri-Rolla     Applied Mathematics
4                           US Military Academy; MIT  Mechanical Engineering

          Graduate Major Military Rank         Military Branch  Space Flights  \
0                Geology           NaN                     NaN              2
1          Solar Physics           NaN                     NaN              1
2  Aerospace Engineering       Colonel       US Army (Retired)              2
3    Applied Mathematics       Colonel  US Air Force (Retired)              4
4           Astronautics       Colonel  US Air Force (Retired)              2

   Space Flight (hr)  Space Walks  Space Walks (hr)  \
0               3307            2              13.0
1                190            0               0.0
2                334            0               0.0
3                814            4              29.0
4                289            2               8.0

                                            Missions Death Date Death Mission
0             STS-119 (Discovery), ISS-31/32 (Soyuz)        NaT           NaN
1                              STS 51-F (Challenger)        NaT           NaN
2               STS-28 (Columbia), STS-43 (Atlantis)        NaT           NaN
3  STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...        NaT           NaN
4                               Gemini 12, Apollo 11        NaT           NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [14]:
# Your code here:
astronaut.value_counts()

Name                 Year    Group  Status    Birth Date  Birth Place      Gender  Alma Mater                                                              Undergraduate Major     Graduate Major                              Military Rank       Military Branch  Space Flights  Space Flight (hr)  Space Walks  Space Walks (hr)  Missions                                     Death Date  Death Mission
William C. McCool    1996.0  16.0   Deceased  1961-09-23  San Diego, CA    Male    US Naval Academy; University of Maryland; US Naval Postgraduate School  Naval Sciences          Computer Science; Aeronautical Engineering  Commander           US Navy          1              382                0            0.0               STS-107 (Columbia)                           2003-02-01  STS-107 (Columbia)       1
Rick D. Husband      1995.0  15.0   Deceased  1957-07-12  Amarillo, TX     Male    Texas Tech University; California State University                      Mechanical Engineering  Mechanical Engineering                      Colonel             US Air Force     2              617                0            0.0               STS-96 (Discovery), STS-107 (Columbia)       2003-02-01  STS-107 (Columbia)       1
Michael P. Anderson  1995.0  15.0   Deceased  1959-12-25  Plattsburgh, NY  Male    University of Washington; Creighton University                          Physics & Astronomy     Physics                                     Lieutenant Colonel  US Air Force     2              594                0            0.0               STS-89 (Endeavor), STS-107 (Columbia)        2003-02-01  STS-107 (Columbia)       1
Michael J. Smith     1980.0  9.0    Deceased  1945-04-30  Beaufort, NC     Male    US Naval Academy; US Naval Postgraduate School                          Naval Sciences          Aeronautical Engineering                    Captain             US Navy          1              0                  0            0.0               STS 51-L (Challenger)                        1986-01-28  STS 51-L (Challenger)    1
Laurel B. Clark      1996.0  16.0   Deceased  1961-03-10  Ames, IA         Female  University of Wisconsin-Madison                                         Zoology                 Medicine                                    Captain             US Navy          1              382                0            0.0               STS-107 (Columbia)                           2003-02-01  STS-107 (Columbia)       1
Ellison S. Onizuka   1978.0  8.0    Deceased  1946-06-24  Kealakekua, HI   Male    University of Colorado                                                  Aerospace Engineering   Aerospace Engineering                       Lieutenant Colonel  US Air Force     2              73                 0            0.0               STS 51-C (Discovery), STS 51-L (Challenger)  1986-01-28  STS 51-L (Challenger)    1
David M. Brown       1996.0  16.0   Deceased  1956-04-16  Arlington, VA    Male    College of William & Mary; Eastern Virginia Medical School              Biology                 Medicine                                    Captain             US Navy          1              382                0            0.0               STS-107 (Columbia)                           2003-02-01  STS-107 (Columbia)       1
dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a tab separated file using the `to_csv` function. Call the file `astronaut.csv` and remember to remove the index column.

In [19]:
# Your code here:
astronaut.to_csv('astronaut.csv', sep='\t', index=False)

None

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function.

In [16]:
# Your code here: